// Домашнє:
// =====================================================
// 1.Створити змінні. Присвоїти кожному з них значення: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false.
//  Вивести кожну змінну за допомогою: console.log , alert, document.write

let str = 'Hello';
let names = ['own', 'com', 'ua'];
let pi = [1, 10, -999, 123, 3.14, 2.7, 16];
let isAdmin = true;
let isSuperAdmin = false;

console.log(str);
alert(str);
document.write(str);

console.log(names[0], names[1], names[2]);
alert(`${names[0]}. ${names[1]}. ${names[2]}`);
document.write(`
    <hr> 
    <div>${names[0]}.${names[1]}.${names[2]}</div>
    <hr>
    `);

console.log(pi[0], pi[1], pi[2], pi[3], pi[4], pi[5], pi[6]);
alert(`${pi[0]}, ${pi[1]}, ${pi[2]}, ${pi[3]}, ${pi[4]}, ${pi[5]}, ${pi[6]}`);
document.write(`
    <div>${pi[0]}, ${pi[1]}, ${pi[2]}, ${pi[3]}, ${pi[4]}, ${pi[5]}, ${pi[6]}</div>
    <hr>
`);

console.log(isAdmin, isSuperAdmin);
alert(`${isAdmin} / ${isSuperAdmin}`);
document.write(`
    <div>${isAdmin}/${isSuperAdmin}</div>
    <hr>
`);

// =============================================================
// 2.Переприсвоїти кожну змінну з завдання вище на будь які довільні значення.
//  Вивести кожну змінну за допомогою: console.log , alert, document.write

srt = 'Welcome!';
names = ['I', 'am', 'Olha'];
pi = [24, 7, 1996];
isAdmin = false;
isSuperAdmin = true;

console.log(srt);
alert(str);
document.write(str);

console.log(names[0], names[1], names[2]);
alert(`${names[0]} ${names[1]} ${names[2]}`);
document.write(`
    <hr>
    <div>${names[0]} ${names[1]} ${names[2]}
    <hr>
`);

console.log(pi[0], pi[1], pi[2]);
alert(`${pi[0]}.${pi[1]}.${pi[2]}`);
document.write(`
<div>${pi[0]}.${pi[1]}.${pi[2]}
`);


// ========================================================
// 3.Створити 3 змінних firstName, middleName, lastName, наповнити їх своїм ПІБ. Зконкатенувати їх в одну змінну person.

let person = {
    firstName: 'Olha',
    middleName: 'Petrivna',
    lastName: 'Kostiv'
};

// =========================================================
// 4.За допомогою 3х різних prompt() отримати 3 слова які являються вашими Імям, По-Батькові та роками.
// Вивести "Вітаю *Імя* *По батькові*. Тобі *вік* років".

let person1 = prompt('Імя');
let person2 = prompt('По-батькові');
let age = prompt('вік');

alert(`Вітаю ${person1} ${person2}. Тобі ${age} років.`);

// ===========================================================
//5.За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
//   let a = 100; let b = '100'; let c = true; 

let a = 100;
let b = '100';
let c = true;

console.log(typeof a);
console.log(typeof b);
console.log(typeof c);

// ============================================================
// 6.Поставет відповідний оператор в виразах що б вийшов відповідний результат.
// В однакових виразаї не використовувати однакові оператори!!!
// 5 ? 6 -> true
// 5 ? 6 -> false
// 5 ? 6 -> false
// 5 ? 6 -> false
// 10 ? 10 -> true
// 10 ? 10 -> true
// 10 ? 10 -> false
// 10 ? 10 -> false
// 10 ? 10 -> false
// 123 ? '123' -> false
// 123 ? '123' -> true

console.log(5<6);
console.log(5>6);
console.log(5==6);
console.log(5===6);
console.log(10==10);
console.log(10===10);
console.log(10>10);
console.log(10<10);
console.log(10!==10);
console.log(123===123);
console.log(123=='123');

// ==================================================================
// ==================================================================


// Практичне:

// 1.Оголосіть змінні str, num, flag и txt зі значеннями «Привіт», 123, true, «true».
// За допомогою typeof переконайтесь, що значення змінних належать типам: string, number и  boolean.

let str1 = 'Hello';
let num = 123;
let flag = true;
let txt = 'true';

console.log(typeof str1);
console.log(typeof num);
console.log(typeof flag);
console.log(typeof txt);

// =====================================================================
// 2.Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних оператцій отримайте числа:
    // 34, 12, 66, 90, 87
    // Старайтесь використовувати різні оператори.

let a1 = ((10*3)+4);
let a2 = (2+(5*2));
let a3 = ((6*10)+(3*2));
let a4 = ((50/2)+65);
let a5 = (100-40+27);

console.log(a1);
console.log(a2);
console.log(a3);
console.log(a4);
console.log(a5);

// =====================================================================
// 3.Створіть змінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
    // 5 % 3,
    // 3 % 5,
    // 5 + '3',
    // '5' - 3,
    // 75 + 'кг'

console.log(5%3);
let a6 = 2;
console.log(3%5);
let a7 = 3;
console.log(5+'3');
let a8 = '53';
console.log('5'-3);
let a9 = 2;
console.log(75+'kg');
let10 = '75kg';

// =======================================================================
// 4.Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
//    Значееня площі зберігати в змінній s.

let height = 23;
let width = 10;
let s = (height*width);

console.log(s);

// =======================================================================
// 5. Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
    // результат поместите в переменную v.

let heightC = 10;
let dC = 4;
let v = (3.14*heightC*dC);

console.log(v);

// ========================================================================
// 6. У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
//    Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).

let n = 3;
let m = 4;
let k = (Math.pow(n, 2)*Math.pow(m, 2));

console.log(k);

// =======================================================================
// 7. Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).

let firstName1 = 'Olha';
let middleName1 = 'Petrivna';
let lastName1 = 'Kostiv';
let age1 = 24;
let sport = 'equestrian sport';

alert(`${firstName1} ${middleName1} ${lastName1}\n${age1}\n${sport}`);

// ========================================================================
// 8.Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//   Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//   Вывести в документ содержимое переменной concatenation спомощью document.write

let str2 = 'Кто'
let str3 = 'ты'
let str4 = 'такой?'
let concatenation = [str2 + ' ' + str3 + ' ' + str4];

document.write(`
    <hr></hr>
    <div>${concatenation}</div>
    <hr>
`);


// =========================================================================
// 9.  С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert

let num2 = prompt('число1:');
let num3 = prompt('число2:');

alert(num2 + num3);


// =========================================================================
// 10. С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, а вам не обходимо вывести строку такого вида
    //   Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert

let prom1 = prompt('Імя:');
let prom2 = prompt('Прізвище:');
let age2 = prompt('Вік:');

alert(`Доброго вечора ${prom1} ${prom2}, мої вітання, що вам ${age2}!`);


